angular.module('starter.dbModule',[])
.service("dbModule",function($cordovaSQLite) {


	this.openDb=function() {
		var db = $cordovaSQLite.openDB({ name: "my.db", location: 'default' });
		return db;
	}

	this.createDatabase=function() {

		db=this.openDb();
		var countrysTab="CREATE TABLE IF NOT EXISTS countrys (country_id INT PRIMARY KEY NOT NULL ,country_name, country_code)";
		var countrysName="INSERT INTO countrys (country_id, country_name, country_code) VALUES"+"(1,'تونس','tn'),"+"(2,'الجزائر','dz')";
		$cordovaSQLite.execute(db, countrysTab).then(function(res) {
			console.log("succsses countrysTab");
	 		$cordovaSQLite.execute(db, countrysName).then(function(res) {
	      		console.log("countrysName insert");
	    	}, function (err) {
	      		//console.error(err);
	    	});
    	}, function (err) {
      		console.error(err);
    	});

    	var DZ="CREATE TABLE IF NOT EXISTS dz (id INT PRIMARY KEY NOT NULL,titel,lat,lon)";
    	var dzQuery="INSERT INTO dz (id, titel,lat,lon) VALUES"+
		"(1,'أدرار',27.97163,-0.18696),"+"(2,'الشلف',36.14742,1.30837),"+"(3,'الأغواط',33.79726,2.86941),"+
		"(4,'أم البواقي',35.7898148,6.4953635),"+"(5,'باتنة',35.56102,6.17391),"+"(6,'بجاية',36.75089,5.05673),"+
		"(7,'بسكرة',34.83703,5.75105),"+"(8,'بشار',31.61825,-2.21432),"+"(9,'البليدة',36.47987,2.80057),"+
		"(10,'البويرة',36.28353,3.98784),"+"(11,'تمنراست',22.2733164,4.5539995),"+"(12,'تبسة',35.4117909,8.0755253),"+
		"(13,'تلمسان',34.8960195,-1.3501175),"+"(14,'تيارت',35.3601096,1.3215751),"+"(15,'تيزي وزو',36.7003239,4.0054471),"+
		"(16,'الجزائر',36.75377,3.05879),"+"(17,'الجلفة',34.67517,3.26842),"+"(18,'جيجل',36.81674,5.74909),"+
		"(19,'سطيف',36.1906353,5.3501726),"+"(20,'سعيدة',34.8420105,0.1133387),"+"(21,'سكيكدة',36.8779079,6.8656797),"+
		"(22,'سيدي بلعباس',35.2064541,-0.7001775),"+"(23,'عنابة',36.92646,7.75254),"+"(24,'قالمة',36.45898,7.43273),"+
		"(25,'قسنطينة',36.36015,6.64243),"+"(26,'المدية',36.2839588,2.7028055),"+"(27,'مستغانم',36.01312,0.14014),"+
		"(28,'المسيلة',35.31663,4.23334),"+"(29,'معسكر',35.39041,0.14950),"+"(30,'ورقلة',32.1910245,4.6765017),"+
		"(31,'وهران',35.7075784,-0.7114535),"+"(32,'البيض',32.35467,0.60147),"+"(33,'إليزي',26.50943,8.47327),"+
		"(34,'برج بوعريريج',36.07998,4.81060),"+"(35,'بومرداس',36.76760,3.70290),"+"(36,'الطارف',36.72988,8.28695),"+
		"(37,'تندوف',27.2330452,-8.5699009),"+"(38,'تيسمسيلت',35.7529924,1.5870432),"+"(39,'الوادي',33.37134,6.84797),"+
		"(40,'خنشلة',35.43099,7.14671),"+"(41,'سوق أهراس',36.277913,7.9242103),"+"(42,'تيبازة',36.5967,2.3392321),"+
		"(43,'ميلة',36.45123,6.25353),"+"(44,'عين الدفلى',36.1286199,1.8970544),"+"(45,'النعامة',33.1968325,-1.9235644),"+
		"(46,'عين تموشنت',35.359979,-1.338295),"+"(47,'غرداية',32.49022,3.67384),"+"(48,'غليزان',35.7296576,0.5244033)";
	 	$cordovaSQLite.execute(db, DZ).then(function(res) {
	 		console.log("succsses dz created");
	 		$cordovaSQLite.execute(db, dzQuery).then(function(res) {
	 			console.log("dzQuery insert");
    		}, function (err) {
    			//console.error(err);
    		});
	    }, function (err) {
	      console.error(err);
	    });
		var TN="CREATE TABLE IF NOT EXISTS tn (id INT PRIMARY KEY NOT NULL,titel,lat,lon,info)";
		var tnQuery = "INSERT  INTO tn (id, titel,lat,lon,info) VALUES"+
				"(1,'أريانة',36.8688529,10.2052935,'ولاية أريانة هي إحدى ولايات الجمهورية التونسية الاربع والعشرين، وتكون مع ولايات تونس، بن عروس ومنوبة إقليم تونس الكبرى. صدر مرسوم أحداث الولاية في مارس 1983. تقع هذه الولاية في شمال البلاد ويحدّها شرقا البحر الأبيض المتوسط، جنوبا ولاية تونس، غربا ولاية منوبة وشمالا ولاية بنزرت. يبلغ عدد سكانها 576.088 نسمة (تعداد 2014) وتبلغ مساحتها 482 كيلومتر مربع. يقع مقر الولاية بمدينة أريانة.'),"+
				"(2,'باجة',36.7297085,9.2050689,'باجة هي مدينة تونسية تقع في إقليم الشمال الغربي وهي عاصمة ولاية باجة. تبعد قرابة 105 كم عن العاصمة تونس ويبلغ تعداد سكانها 62.303 في عام 2014. تختص مدينة باجة في الجمهورية التونسية بالإنتاج الفلاحي نظراً لتوفر الأراضي الخصبة والمناخ الملائم للنشاط الفلاحي فهي تقع في منطقة الشمال الغربي الأكثر خضرة في تونس.'),"+
				"(3,'بن عروس',36.7456571,10.2455045,'ولاية بن عروس هي إحدى ولايات الجمهورية التونسية الـ24. تقع الولاية في شمال البلاد وتكون مع ولايات تونس، أريانة ومنوبة إقليم تونس الكبرى. تم إحداثها سنة 1983 في الثالث من ديسمبر. تبلغ مساحتها 790 كم² ويقطنها حوالي 631.842 نسمة (تعداد 2014).'),"+
				"(4,'بنزرت',37.2751301,9.8802131,'بنزرت هي مدينة ساحلية في أقصى شمال القارة الأفريقية و عاصمة ولاية بنزرت في الجمهورية التونسية و تقع على بعد 65 كيلومترا شمالي مدينة تونس , وصل تعداد سكانها 136.917 نسمة(إحصائيات 2014).'),"+
				"(5,'تطاوين',32.9245781,10.4774385,'تقع مدينة تطاوين في أقصى الجنوب الشرقي للجمهورية التونسية، وهي من ولايات تونس وأكبرها مساحة. يبلغ عدد سكانها أكثر من 142500 ساكن يقطنون أساسا شرق الجهة الذي يحده طبيعيا عن الجهة الغربية الصحراوية سلسلة جبال مطماطة. وتعتبر هذة السلسلة الجبلية هي وسلسلة جبال الضاهر هم من المشاهد الطبيعية في ولاية تطاوين. وليست الجهة الشرقية بأوفر حظا فأغلبها(40%) أراض قاحلة تعاني من نقص فادح في الموارد المائية السطحية ومراعي الأغنام.'),"+
				"(6,'توزر',33.9186755,8.1547742,'توزر هي مدينة وواحة صحراوية تقع في الجنوب الغربي للجمهورية التونسية ويبلغ عدد سكانها حوالي 40.000 نسمة، وهي عاصمة ولاية توزر ومركز بلاد الجريد. تقع توزر في الشمال الغربي لشط الجريد وجنوبي شط الغرسة، على بعد 430 كم من العاصمة تونس.'),"+
				"(7,'جندوبة',36.5032857,8.7963582,'جَنْدُوبَة (من الأمازيغية: جندوبة، من جن: سوق و دوبة : قمح. كانت تسمى قبل عام 1966 باسم سوق الأربعاء)، وفيها يقع مقر ولاية جندوبة. تقع المدينة في سهل وادي مجردة وتبعد على العاصمة 154 كلم و50 كلم عن الحدود الجزائرية و هي من إحدى أهم مدن إقليم الشمال الغربي.'),"+
				"(8,'زغوان',36.3537985,10.2629804,'ولاية زغوان التي تأسست 1976، هي إحدى ولايات تونس الأربعة والعشرين. تبلغ مساحتها 2.768 كم² (أي 1,7% من مساحة البلاد) وتعداد سكانها سنة 2014 176.945 نسمة (وهي تحتل بذلك المرتبة 21 بين ولايات تونس حيث عدد السكان). مركزها مدينة زغوان.'),"+
				"(9,'سليانة',35.9828141,9.902982,'سليانة، مدينة تونسية تقع في إقليم الشمال الغربي وفيها يقع مقر ولاية سليانة. تقع المدينة على بعد عشرة كيلومترات من موقع معركة زاما التي جمعت القرطاجيين بقيادة حنبعل والرومان بقيادة شيبيو الإفريقي في إطار الحرب البونيقية الثانية. تبعد سليانة عن تونس العاصمة ب 127 كم و القيروان ب 93 كم و سوسة ب 156 كم و بنزرت ب 190 كم و نابل ب 157 كم و صفاقس ب 225 كم.'),"+
				"(10,'سوسة',35.8293395,10.6553869,'سُوسَة هي مدينة تونسية، تقع على بعد 140 كم جنوب العاصمة، وتقع وسط السواحل الشرقية لتونس.'),"+
				"(11,'سيدي بوزيد',34.8925347,9.9941593,'ولاية سيدي بوزيد هي إحدى ولايات الجمهورية التونسية الـ24 من سنة1973, مساحتها 6994 كم مربع. وبلغ عدد سكان الولاية 912 429 ساكن حسب إحصائيات رسمية لسنة 2014, بها 12 معتمدية أكبرها سيدي بوزيد الغربية وسيدي بوزيد الشرقية والرقاب وجلمة والمزونة، هي ولاية فلاحية من أهم إنتاجها الخضر وزيت الزيتون. مركز الولاية مدينة سيدي بوزيد'),"+
				"(12,'صفاقس',34.7567069,10.8528206,'صفاقس مدينة تونسية تقع على خليج قابس، وهي مركز ولاية صفاقس. تعتبر عاصمة الجنوب التونسي، رغم أنّها تقع في وسط البلاد، وذلك لأنّها ثاني أكبر المدن التّونسيّة في المساحة وفي عدد السّكّان. وتُعرف صفاقس بنشاطها الثقافي المميّز الّذي أهّلها لكي تكون عاصمة للثّقافة العربيّة لسنة 2016.'),"+
				"(13,'ڨابس',33.8892777,10.1201249,'قَابُس هي مدينة تونسية ومركز ولاية قابس، يقطنها حوالي 130.984 (تعداد سنة 2014). تقع المدينة على الخليج الذي يحمل نفس الاسم والذي يعتبر من أهم المحميات الطبيعية بالبلاد التونسية. تبعد حوالي 405 كلم على العاصمة التونسية تونس..'),"+
				"(14,'ڨبلي',33.7036675,8.9909792,'ڨبلي وتكتب قبلي هي مدينة بالجنوب التونسي تعرف بولاية نفزواوة ابان حكم البايات وماقبلهم. يبلغ عدد سكانها 18693 نسمة (2004) ، وهي مركز بلدية منذ 9 جانفي 1957، وكانت آنذاك تابعة إلى ولاية توزر ثم ألحقت بولاية قابس قبل أن تصبح مقرا لولاية تحمل اسمعا منذ عام 1981.'),"+
				"(15,'الڨصرين',35.1702578,8.8597016,'الڨَصْرِين مدينة تونسية تقع في الوسط الغربي التونسي، تبعد 290 كم  عن العاصمة. وهي مركز ولاية بنفس الاسم.وتعود تسمية المدينة نسبة الي قصرين من عهد الرومان.'),"+
				"(16,'ڨفصة',34.4285901,8.7911272,'قفصة، هي كبرى مدن الجنوب الغربي التونسي وفيها يقع مقر ولاية قفصة. يبلغ عدد سكان بلدية المدينة حوالي 95.242 نسمة. شهدت المدينة سنتي 1942 و1943 أثناء الحرب العالمية الثانية عدة عمليات قصف تسببت في إحداث دمار جزء من القصبة. في يناير 1980 شهدت المدينة حركة مسلحة قام بها كوموندوس مناوئ لحكم الرئيس الحبيب بورقيبة. يرتكز النشاط الاقتصادي في قفصة أساسا على استخراج الفوسفاط الذي تم اكتشافه لاول مرة في جبال الثالجة في مدينة المتلوي في بداية الاستعمار الفرنسي . تبث من المدينة إذاعة صوت المناجم التي تغطي ولاية قفصة و إذاعة قفصة التي تغطي كامل الجنوب الغربي، ويوجد في المدينة مطار قفصة قصر الدولي. والمدينة مقر لنادي القوافل الرياضية بقفصة التي تنشط في الرابطة التونسية المحترفة لكرة القدم. ومن أشهر رموزها جبل عرباطة ومحمية عرباطة.'),"+
				"(17,'القيروان',35.6742641,10.1360899,'القَيْرَوَان مدينة تونسية، تبعد حوالي 160 كيلومتر عن تونس العاصمة ويعود سبب أهميتها إلى دورها الاستراتيجي في الفتح الإسلامي فمنها انطلقت حملات الفتح نحو الجزائر والمغرب وإسبانيا وأفريقيا بالإضافة إلى أنها رقاد لعدد من صحابة رسول الإسلام محمد و يطلق عليها الفقهاء رابعة الثلاث، بعد مكة و المدينة المنورة و القدس وفي هذه المدينة توجد أهم المعالم للقيروان 《الجامع الكبير》 و قد أسسه عقبة ابن نافع.'),"+
				"(18,'الكاف',36.1668598,8.7197878,'الكاف مدينة تونسية تقع في الشمال الغربي وهي عاصمة ولاية الكاف. بلغ عدد سكانها حوالي 73,706 نسمة وذلك في سنة 2014. تقع مدينة الكاف فوق آثار مدينة رومانية تعرف باسم سِكّا فِنِيرِيَا Sicca Veneria ومنها يتأصل اسم الكاف.'),"+
				"(19,'مدنين',33.0777922,11.2115581,'تقع مدينة مدنين بالجنوب الشرقي للجمهورية التونسية تتبع إداريا ولاية مدنين وتضمم معتمدية مدنين الجنوبية ومعتمدية مدنين الشمالية وهي تتوسط سهل الجفارة. تبعد عن تونس العاصمة 482 كلم وعن مدينة قابس 75 كلم. وتمتاز المدينة بموقع إستراتيجي نظرا لوجودها على الطريق الوطنية رقم 1 الرابطة بين تونس ورأس الجدير.'),"+
				"(20,'المنستير',35.7542418,10.8453247,'المنستير مدينة تونسية ومركز ولاية المنستير، تعد واحدة من أهم مدن تونس. تبعد 24 كم عن سوسة و 80 كم عن القيروان. يقطنها نحو نصف مليون ساكن، وهي منتجع سياحي بامتياز، ومركز تعليمي بارز، ظلت على مدى نصف قرن مدينة الوزراء والحكام في تونس، فمن بين 18 وزيرا في عهد بورقيبة منحت لمدينة الرئيس 15 حقيبة. كانت المدينة مستعمرة فينيقية تعرف بروسبينا أسسها مهاجرون من صور في نهاية القرن السادس ق.م تحديدا في عام 509 ق.م حيث ورد ذكر المدينة في المعاهدة التي عقدت بين القرطاجيين والرومان في ذلك العام. وقد أتخذها يوليوس قيصر كقاعدة عسكرية له.'),"+
				"(21,'منوبة',36.7857132,9.9573116,'ولاية مَنُّوبَة، إحدى ولايات الجمهورية التونسية الـ24. تقع في شمال البلاد تحدّها شرقا ولايتا أريانة وتونس، شمالا ولاية بنزرت، غربا ولاية باجة وجنوبا ولاية زغوان. يبلغ عدد سكانها الـ379.518 نسمة (تعداد 2014). يقع مقر الولاية بمدينة منوبة'),"+
				"(22,'المهدية',35.504731,11.0695236,'المهدية مدينة ساحلية تونسية ومقر لولاية المهدية. المهدية (مهدية) هي مدينة ساحلية تقع 205 كلم جنوب تونس العاصمة.و هي أيضا عاصمة ولاية المهدية.'),"+
				"(23,'نابل',36.7581642,11.0131579,'نَابُل هي مدينة ساحلية في الشمال الشرقي التونسي، في الساحل الجنوبي لشبه جزيرة الوطن القبلي. وهي مستعمرة رومانية قديمة تعود تسميتها إلى اليونانية نِيَابُولِيسْ Neapolis أي المدينة الجديدة وهي تتقاسم ذلك مع مدينتي نابولي ونابلس. وهي مقصد سياحي هام وتعد مركز صناعة الفخار بتونس. المدينة مركز ولاية نابل وتعد 56,387 نسمة (2004 إحصاء).'),"+
				"(24,'تونس',36.7948624,10.2131458,'تونس هي عاصمة الجمهورية التونسية، وأكبر مُدنها من حيث عدد السكان، وهي أيضا عاصمة ولاية تونس. تقع المدينة في شمال البلاد مُطلّة على الجانب الشرقي لخليج البحر الأبيض المتوسط وتتركب المدينة من جزأين: جزء قديم والذي يتمثل في المدينة العتيقة التي تقع على ربوة ذات منحدرات خفيفة متجّهة نحو بحيرة تونس شرقا ونحو سبخة السيجومي غربا، وجزء حديث يتمثل في المدينة الحديثة التي تمتد حول المدينة العتيقة والبحيرة.')";
 		$cordovaSQLite.execute(db, TN).then(function(res) {
 			console.log("succsses TN created");
	    	$cordovaSQLite.execute(db, tnQuery).then(function(res) {
	    		console.log("tnQuery insert");
	    	}, function (err) {
	      		//console.error(err);
	    	});
    	}, function (err) {
    		console.error(err);
    	});

    	var questions="CREATE TABLE IF NOT EXISTS questions (id INT PRIMARY KEY NOT NULL, country_id, question,possibilite1, possibilite2, possibilite3, reponse)";
    	var insQestion="INSERT INTO questions (id, country_id, question, possibilite1, possibilite2, possibilite3, reponse) VALUES"+
"(1,1,'متى استقلت البلاد التونسية؟',' 20 مارس 1952','20 مارس 1955','20 مارس 1956',3),"+"(2,1,'في اي قارة تقع البلاد التونسية؟','افريقيا','اسيا','اوروبا',1),"+
"(3,1,'اين تقع اعلى نقطة في تونس؟','زغوان','القصرين','سليانة',2),"+"(4,1,'كم تبلغ مساحة البلاد التونسية؟','153,610 كم2','163,610 كم2','173,610 كم2',2),"+
"(5,1,'متى تاسست مدينة القيروان؟','50 هـ / 670 م','60 هـ / 680 م','70 هـ / 690 م',1),"+"(6,1,'متى وقع احتلال البلاد التونسية؟','12 ماي 1881','12 ماي 1781','12 ماي 1681',1),"+
"(7,1,'ما هي البلاد التي تحد تونس غربا؟','التشاد','الجزائر','ليبيا',2),"+"(8,1,'متى اندلعت الثورة التونسية؟','27 فيفري 2011','14 جانفي 2011','17 ديسمبر 2010',3),"+
"(9,1,'اين اندلعت الثورة التونسية؟','القصرين','سيدي بوزيد','تونس',2),"+"(10,1,'اين تقع الحديقة الوطنية بإشكل؟','بنزرت','باجة','منوبة',1),"+
"(11,1,'كم تبلغ مساحة الحديقة الوطنية جبل بوهدمة؟','14.488 هكتار','16.488 هكتار','18.488 هكتار',2),"+"(12,1,'اين تقع الحديقة الوطنية بالفايجة؟','باجة','سليانة','جندوبة',3),"+
"(13,1,'ما هي عاصمة تونس؟','قفصة','تونس','القيروان',2),"+"(14,1,'متى تأسس المتحف الوطني بباردو؟','1882 م','1888 م','1985 م',1),"+
"(15,1,'اين يقع المتحف الوطني بباردو؟','اريانة','بن عروس','تونس',3),"+"(16,1,'حسب المساحة، ما هي اكبر ولاية في تونس؟','صفاقس','قبلي','تطاوين',3),"+
"(17,1,'من اسس قرطاج؟','حانون الأول','عليسة','حنبعل',2),"+"(18,1,'عاصمة الثقافة العربية لسنة 2016؟','تونس','صفاقس','القيروان',2),"+
"(19,1,'في اي ولاية يقع قصر الجم؟','المهدية','المنستير','سوسة',1),"+"(20,1,'ماهي الولاية الملقبة بعاصمة الجنوب؟','قفصة','صفاقس','قابس',2),"+
"(21,1,'اعلى نقطة في تونس؟','جبل السرج','جبل الشعانبي','جبل لجرد',2),"+"(22,1,'متى ولد ابن خلدون؟','عام 1331','عام 1332','عام 1333',2),"+
"(23,1,'متى تاسس جامع الزيتونة؟','698 م','732 م','704 م',1),"+"(24,1,'اين تقع مطماطة؟','مدنين','تطاوين','قابس',3)";
    	$cordovaSQLite.execute(db, questions).then(function(res) {
 			console.log("succsses questions created");
	    	$cordovaSQLite.execute(db, insQestion).then(function(res) {
	    		console.log("qustion insert");
	    	}, function (err) {
	      		//console.error(err);
	    	});
    	}, function (err) {
    		console.error(err);
    	});
    	var scoreTab="CREATE TABLE IF NOT EXISTS score (id INTEGER PRIMARY KEY AUTOINCREMENT,dateSave, score, fouls)";
    	$cordovaSQLite.execute(db, scoreTab).then(function(res) {
 			console.log("succsses score created");
	    	
    	}, function (err) {
    		console.error(err);
    	});
 	}
	this.getCountryTunisia=function(callback) {

		db=this.openDb();
		var select ="SELECT * FROM tn";
		
		$cordovaSQLite.execute(db, select).then(function(res) {

			var cty=[];
			for (var i = 0; i < res.rows.length; i++) {
				var id = res.rows.item(i).id;
   				var name = res.rows.item(i).titel;
   				//console.log(name);
   			 	cty.push(res.rows.item(i));
   			}
   			callback(cty);
   			

   			return cty;
   			
		
    	}, function (err) {
      		console.error(err);
    	});
    	
	}
	this.getqestionTunisia=function(callback) {

		db=this.openDb();
		var select ="SELECT * FROM questions";
		
		$cordovaSQLite.execute(db, select).then(function(res) {

			var qst=[];
			for (var i = 0; i < res.rows.length; i++) {
				var id = res.rows.item(i).id;
   				var name = res.rows.item(i).titel;
   				//console.log(name);
   			 	qst.push(res.rows.item(i));
   			}
   			callback(qst);
   			

   			return qst;
   			
		
    	}, function (err) {
      		console.error(err);
    	});
    	
	}
	this.insertScore=function (score) {
		// body...
		db=this.openDb();
		console.log(score);
		var select ="SELECT * FROM score"; 
		var insert="INSERT INTO score (dateSave, score, fouls) VALUES(Date('now'),"+score.score+","+score.fouls+")";
		$cordovaSQLite.execute(db, insert).then(function(res) {
 			//console.log(res);
	    	
    	}, function (err) {
    		console.error(err);
    	});
		$cordovaSQLite.execute(db, select).then(function(res) {
 			var s=[];
			for (var i = 0; i < res.rows.length; i++) {
				var id = res.rows.item(i).id;
   				var name = res.rows.item(i).titel;
   				//console.log(name);
   			 	s.push(res.rows.item(i));
   			}
   			console.log(s);
	    	
    	}, function (err) {
    		console.error(err);
    	});

	}
	this.getCountryDzayer=function(callback) {
		//liste des questions par country
		db=this.openDb();
		var select ="SELECT * FROM dz";
		$cordovaSQLite.execute(db, select).then(function(res) {

			var cty=[];
			for (var i = 0; i < res.rows.length; i++) {
				var id = res.rows.item(i).id;
   				var name = res.rows.item(i).titel;
   				//console.log(name);
   			 	cty.push(res.rows.item(i));
   			}
   			return cty;
   			callback(cty);
		
    	}, function (err) {
      		console.error(err);
    	});  
	}

})