angular.module("starter.factory",[])

.factory("droppabledata",function(){
	return {
		getData: function() {
			return [
			{
 		"تونس‎":[
 		{"id":1,"titel":"أريانة","lat":36.8688529,"lon":10.2052935,"info":"aaaaaa"},
    	{"id":2,"titel":"باجة","lat":36.7297085,"lon":9.2050689,"info":"aaa"},
    	{"id":3,"titel":"بن عروس","lat":36.7456571,"lon":10.2455045,"info":"aaaaa"},
    	{"id":4,"titel":"بنزرت","lat":37.2751301,"lon":9.8802131,"info":"ass"},
    	{"id":5,"titel":"تطاوين","lat":32.9245781,"lon":10.4774385,"info":"aaaaa"},
	    {"id":6,"titel":"توزر","lat":33.9186755,"lon":8.1547742,"info":"aaaaa"},
	    {"id":7,"titel":"جندوبة","lat":36.5032857,"lon":8.7963582,"info":"aaaaa"},
	    {"id":8,"titel":"زغوان","lat":36.3537985,"lon":10.2629804,"info":"aaaaa"},
	    {"id":9,"titel":"سليانة","lat":35.9828141,"lon":9.902982,"info":"aaaaa"},
	    {"id":10,"titel":"سوسة","lat":35.8293395,"lon":10.6553869,"info":"aaaaa"},
	    {"id":11,"titel":"سيدي بوزيد","lat":34.8925347,"lon":9.9941593,"info":"ولاية سيدي بوزيد هي إحدى ولايات الجمهورية التونسية الـ24 من سنة1973, مساحتها 6994 كم مربع. وبلغ عدد سكان الولاية 912 429 ساكن حسب إحصائيات رسمية لسنة 2014, بها 12 معتمدية أكبرها سيدي بوزيد الغربية وسيدي بوزيد الشرقية والرقاب وجلمة والمزونة، هي ولاية فلاحية من أهم إنتاجها الخضر وزيت الزيتون. مركز الولاية مدينة سيدي بوزيد"},
	    {"id":12,"titel":"صفاقس","lat":34.7567069,"lon":10.8528206,"info":"aaaaa"},
	    {"id":13,"titel":"ڨابس","lat":33.8892777,"lon":10.1201249,"info":"aaaaa"},
	    {"id":14,"titel":"ڨبلي","lat":33.7036675,"lon":8.9909792,"info":"aaaaa"},
	    {"id":15,"titel":"الڨصرين","lat":35.1702578,"lon":8.8597016,"info":"aaaaa"},
	    {"id":16,"titel":"ڨفصة","lat":34.4285901,"lon":8.7911272,"info":"aaaaa"},
	    {"id":17,"titel":"القيروان","lat":35.6742641,"lon":10.1360899,"info":"aaaaa"},
	    {"id":18,"titel":"الكاف","lat":36.1668598,"lon":8.7197878,"info":"aaaaa"},
	    {"id":19,"titel":"مدنين","lat":33.0777922,"lon":11.2115581,"info":"aaaaa"},
	    {"id":20,"titel":"المنستير","lat":35.7542418,"lon":10.8453247,"info":"aaaaa"},
	    {"id":21,"titel":"منوبة","lat":36.7857132,"lon":9.9573116,"info":"aaaaa"},
	    {"id":22,"titel":"المهدية","lat":35.504731,"lon":11.0695236,"info":"aaaaa"},
	    {"id":23,"titel":"نابل","lat":36.7581642,"lon":11.0131579,"info":"aaaaa"},
	    {"id":24,"titel":"تونس","lat":36.7948624,"lon":10.2131458,"info":"aaaaa"}
	    ],
	    "DZ":[{"id":24,"titel":"tunis","lat":36.7948624,"lon":10.2131458}]
	}
			]

		},
		getQuestions:function() {

			questions=[];
			return questions;
		}

	}
});
